def area(a, b):
    '''
    Возвращает площадь прямоугольника по двум его сторонам.

    Параметры:
       a (float | int): длина первой стороны прямоугольника.
       b (float | int): длина второй стороны прямоугольника.

    Возвращаемое значение:
       float | int: площадь прямоугольника.

    Пример вызова:
       >>> area(3, 5)
       15
    '''
    return a * b


def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника по двум его сторонам.

    Параметры:
       a (float | int): длина первой стороны прямоугольника.
       b (float | int): длина второй стороны прямоугольника.

    Возвращаемое значение:
       float | int: периметр прямоугольника.

    Пример вызова:
       >>> perimeter(3, 5)
       16
    '''
    return 2 * (a + b)
