def area(a):
    '''
    Возвращает площадь квадрата по длине его стороны.

    Параметры:
       a (float): длина стороны квадрата.

    Возвращаемое значение:
       float: площадь квадрата.

    Пример вызова:
       >>> area(4)
       16
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата по длине его стороны.

    Параметры:
       a (float): длина стороны квадрата.

    Возвращаемое значение:
       float: периметр квадрата.

    Пример вызова:
       >>> perimeter(4)
       16
    '''
    return 4 * a
