def area(a, h):
    '''
    Возвращает площадь треугольника по основанию и высоте.

    Параметры:
       a (float): длина основания треугольника.
       h (float): высота треугольника, опущенная на основание a.

    Возвращаемое значение:
       float: площадь треугольника.

    Пример вызова:
       >>> area(6, 4)
       12.0
    '''
    return a * h / 2


def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника по трем его сторонам.

    Параметры:
       a (float): длина первой стороны треугольника.
       b (float): длина второй стороны треугольника.
       c (float): длина третьей стороны треугольника.

    Возвращаемое значение:
       float: периметр треугольника.

    Пример вызова:
       >>> perimeter(3, 4, 5)
       12
    '''
    return a + b + c
